# Taps
tap "gromgit/fuse" # ntfs-3g-mac
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "noahgorstein/tap" # jqp

# Great TUIs
brew "atui"
brew "bat"
brew "bmon" # Monitor bandwidth
brew "bottom"
brew "btop"
brew "broot" # Display improved dir tree
brew "dua"
brew "duf"
brew "gdu", link: true # improved and interactive du
brew "git-delta" # Improved git diff
brew "glow"
brew "gitui"
brew "gping"
brew "jless"
brew "jqp"
brew "lazydocker"
brew "lazygit"
brew "mosh" # Reliable SSH on bad condition
brew "noahgorstein/tap/jqp" # jq playground
brew "peco" # Filtered less-like
brew "ripgrep"
brew "sshs"
brew "termshark"
brew "tldr"
brew "tokei"
brew "trippy"

# Misc.
brew "asdf"
brew "ffmpeg"
brew "fd" # Find replacement
brew "gromgit/fuse/ntfs-3g-mac"
brew "neovim"
brew "nmap"
brew "git"
brew "gh"
brew "pinentry-mac"
brew "progress" # Display cp, mv, etc. progress
brew "starship"
brew "streamlink"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zsh"

# Casks
cask "android-file-transfer"
cask "android-studio"
cask "appcleaner"
cask "cutter"
cask "dash"
cask "deluge"
cask "devtoys"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "foxitreader"
cask "gimp"
cask "hiddenbar"
cask "iina"
cask "iterm2"
cask "jdownloader"
cask "keka"
cask "keybase"
cask "macfuse"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "raycast"
cask "sf-symbols"
cask "signal"
cask "spotify"
cask "utm"
cask "veracrypt"
cask "vlc"
